In [3]:
from numpy.random import randn
import pandas as pd

In [4]:
mydata = randn(3,4)

In [5]:
mydata

array([[-1.07239633,  1.35335285, -0.00235943,  0.90942611],
       [-0.6412444 ,  1.67940566,  2.28979365, -1.47021128],
       [ 1.40598649, -1.04466359, -0.11370682,  1.34838303]])

In [6]:
mydataframe = pd.DataFrame(mydata, ['r1','r2','r3'],['c1','c2','c3','c4'])

In [7]:
mydataframe

          c1        c2        c3        c4
r1 -1.072396  1.353353 -0.002359  0.909426
r2 -0.641244  1.679406  2.289794 -1.470211
r3  1.405986 -1.044664 -0.113707  1.348383

In [8]:
mydataframe['c5'] = mydataframe['c1'] * mydataframe['c3']

In [9]:
mydataframe.drop('c2',axis=1,inplace=True)

In [10]:
mydataframe

          c1        c3        c4        c5
r1 -1.072396 -0.002359  0.909426  0.002530
r2 -0.641244  2.289794 -1.470211 -1.468317
r3  1.405986 -0.113707  1.348383 -0.159870

In [13]:
mydataframe[mydataframe['c3']>0]

          c1        c3        c4        c5
r2 -0.641244  2.289794 -1.470211 -1.468317

NaN=not any number

# Part 2

In [14]:
mydataframe

          c1        c3        c4        c5
r1 -1.072396 -0.002359  0.909426  0.002530
r2 -0.641244  2.289794 -1.470211 -1.468317
r3  1.405986 -0.113707  1.348383 -0.159870

In [15]:
mydataframe[mydataframe['c4']>0]

          c1        c3        c4       c5
r1 -1.072396 -0.002359  0.909426  0.00253
r3  1.405986 -0.113707  1.348383 -0.15987

In [18]:
mydataframe[(mydataframe['c5']>0) & (mydataframe['c4']>0)]

          c1        c3        c4       c5
r1 -1.072396 -0.002359  0.909426  0.00253

setting a new index

In [19]:
mydataframe

          c1        c3        c4        c5
r1 -1.072396 -0.002359  0.909426  0.002530
r2 -0.641244  2.289794 -1.470211 -1.468317
r3  1.405986 -0.113707  1.348383 -0.159870

In [20]:
mynewindex = ['row1','row2','row3']

In [21]:
mynewindex

['row1', 'row2', 'row3']

In [22]:
mydataframe['new index'] = mynewindex

In [23]:
mydataframe

          c1        c3        c4        c5 new index
r1 -1.072396 -0.002359  0.909426  0.002530      row1
r2 -0.641244  2.289794 -1.470211 -1.468317      row2
r3  1.405986 -0.113707  1.348383 -0.159870      row3

In [24]:
mydataframe.set_index('new index')

                 c1        c3        c4        c5
new index
row1      -1.072396 -0.002359  0.909426  0.002530
row2      -0.641244  2.289794 -1.470211 -1.468317
row3       1.405986 -0.113707  1.348383 -0.159870